DataProcessors/ОбновлениеСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеСборников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/Достижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>Достижения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтоВопросовСыграно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТридцатьВопросовБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерияДвадцатьПравильных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоПятнадцатьСборников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвадцатьВопросовЗаШестьдесятСекунд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сборники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСборника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаСборника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БратьОтветыИзТекущегоСборника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбновлениеСборников/Forms/Форма/Ext/Form/Module.bsl
// Добавляет группу элементов формы в родительскую группу ГруппаРодительВход с префиксом ПрефиксВход, 
// идентификатором ИдентификаторВход. ГруппировкаВход задаёт способ размещения (группировку) элементов.
&НаСервере
Функция ДобавитьГруппуЭлементов(ПрефиксВход, ГруппаРодительВход, ИдентификаторВход, ГруппировкаВход, ЗаголовокВход = "", ОтображатьЗаголовокВход = Ложь)
	НаименованиеНовогоРеквизита = ПрефиксВход + Строка(ИдентификаторВход);
	НайденныйЭлемент = Элементы.Найти(НаименованиеНовогоРеквизита);
	Если НайденныйЭлемент = Неопределено Тогда
		НовыйЭлемент									 = Элементы.Вставить(НаименованиеНовогоРеквизита, Тип("ГруппаФормы"), ГруппаРодительВход);
		НовыйЭлемент.Вид								 = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.ОтображатьЗаголовок				 = ОтображатьЗаголовокВход;
		НовыйЭлемент.Заголовок							 = ЗаголовокВход;
		НовыйЭлемент.ГоризонтальноеПоложениеПодчиненных	 = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.Объединенная						 = Истина;
		НовыйЭлемент.Отображение						 = ОтображениеОбычнойГруппы.Нет;
		НовыйЭлемент.Группировка						 = ГруппировкаВход;
		НовыйЭлемент.РастягиватьПоГоризонтали			 = Истина;
	Иначе
		НовыйЭлемент = НайденныйЭлемент;
	КонецЕсли;
	Возврат НовыйЭлемент;
КонецФункции

// Добавляет декорацию формы в родительскую группу ГруппаРодительВход  с префиксом ПрефиксВход, 
// идентификатором ИдентификаторВход, с видом надпись и заголовком ЗаголовокВход.
&НаСервере
Функция ДобавитьДекорациюНадпись(ПрефиксВход, ГруппаРодительВход, ИдентификаторВход, ЗаголовокВход, ПодсказкаВход = "");
	НаименованиеЭлемента = ПрефиксВход + Строка(ИдентификаторВход);
	НайденныйЭлемент = Элементы.Найти(НаименованиеЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ДекорацияФормы"), ГруппаРодительВход);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = ЗаголовокВход;
		НовыйЭлемент.Подсказка = ПодсказкаВход;
	Иначе
		НовыйЭлемент = НайденныйЭлемент;
	КонецЕсли;
	Возврат НовыйЭлемент;
КонецФункции

// Размещает на форме в группе ГруппаРодительВход элемент с префиксом ПрефиксВход,
// идентификатором ИдентификаторПоказателяВход, заголовком ЗаголовокВход и типом
// элемента формы ТипЭлементаВход. По умолчанию заголовок скрыт. Подключает его к 
// реквизиту НаименованиеРеквизитаВход. Возвращает новый элемент формы.
&НаСервере
Функция ДобавитьЭлементФормы(ПрефиксВход, ГруппаРодительВход, НаименованиеРеквизитаВход, ИдентификаторПоказателяВход, ТипЭлементаВход = Неопределено, ЗаголовокВход = "", ЗаголовокСкрыт = Истина)
	Если ТипЭлементаВход = Неопределено Тогда
		ТипЭлементаРабочий = Тип("ПолеФормы");
	Иначе	
		ТипЭлементаРабочий = ТипЭлементаВход;
	КонецЕсли;
	НаименованиеЭлемента = ПрефиксВход + Строка(ИдентификаторПоказателяВход);
	НайденныйЭлемент = Элементы.Найти(НаименованиеЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить(НаименованиеЭлемента, ТипЭлементаРабочий, ГруппаРодительВход);
		НовыйЭлемент.ПутьКДанным = НаименованиеРеквизитаВход;
		НовыйЭлемент.Заголовок = ЗаголовокВход;
		Если ЗаголовокСкрыт Тогда
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Иначе
			// Новое положение заголовка будет установлено далее.
		КонецЕсли;
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	Иначе
		НовыйЭлемент = НайденныйЭлемент;
	КонецЕсли;
	Возврат НовыйЭлемент;
КонецФункции

// Заполняет в таблицу сборников данные с сайта.
&НаСервере
Процедура СчитатьДанныеСборниковССайта(ЛегкийФайлВход = Истина)
	ТаблицаССайта = ОбменССайтом.ПолучитьТаблицуДанныхСборникаССайта(ЛегкийФайлВход);
	Для Каждого ТекТаблицаССайта Из ТаблицаССайта Цикл
		НоваяСтрока = ТаблицаСборников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекТаблицаССайта);
		Попытка
			НоваяСтрока.РазмерФайла = Число(ТекТаблицаССайта.РазмерФайла);
		Исключение
			НоваяСтрока.РазмерФайла = 0;
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры		// СчитатьДанныеСборниковССайта()	

// Добавляет в таблицу сборников данные сборников текущей базы.
&НаСервере
Процедура СчитатьДанныеСборниковИзБазы()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборники.Ссылка,
		|	Сборники.Версия,
		|	Сборники.Наименование,
		|	Сборники.ИдентификаторСборника
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Найдено = Ложь;
		Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
			Если ТекТаблицаСборников.ИдентификаторСборника = ВыборкаДетальныеЗаписи.ИдентификаторСборника Тогда
				ТекТаблицаСборников.УстановленнаяВерсия	 = ВыборкаДетальныеЗаписи.Версия;
				ТекТаблицаСборников.СборникСсылка		 = ВыборкаДетальныеЗаписи.Ссылка;
				Найдено = Истина;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли;	
		КонецЦикла;	
		Если Не Найдено Тогда
			НоваяСтрока = ТаблицаСборников.Добавить();
			НоваяСтрока.НаименованиеСборника	 = ВыборкаДетальныеЗаписи.Наименование;
			НоваяСтрока.УстановленнаяВерсия		 = ВыборкаДетальныеЗаписи.Версия;
			НоваяСтрока.ИдентификаторСборника	 = ВыборкаДетальныеЗаписи.ИдентификаторСборника;
			НоваяСтрока.СборникСсылка			 = ВыборкаДетальныеЗаписи.Ссылка;
		Иначе
			// Строка добавлена.
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры		// СчитатьДанныеСборниковИзБазы()

// Добавляет на форму команду с префиксом ПрефиксВход и идентификатором ИдентификаторВход.
&НаСервере
Функция ДобавитьКомандуФормы(ПрефиксВход, ИдентификаторВход)
	НаименованиеКоманды = ПрефиксВход + Строка(ИдентификаторВход);
	НоваяКоманда = ЭтаФорма.Команды.Добавить(НаименованиеКоманды);
	Возврат НаименованиеКоманды;
КонецФункции

// Размещает команду с префиксом ПрефиксВход, Идентификатором ИдентификаторВход в группе
// ГруппаРодительВход формы.
&НаСервере
Функция ДобавитьЭлементКоманды(ПрефиксВход, ГруппаРодительВход, ИдентификаторВход)
	ИмяКоманды = ПрефиксВход + ИдентификаторВход;
	НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаРодительВход);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	Возврат НовыйЭлемент; 
КонецФункции

// Создаёт новый реквизит формы с префиксом ПрефиксВход, идентифкатором ИдентификаторВход,
// заголовком ЗаголовокРеквизита и с типом ОписаниеТиповВход, добавляет его в массив МассивДобавленияВход.
// Возвращает наименование реквизита.
&НаСервере
Функция ДобавитьРеквизитФормы(ПрефиксВход, ИдентификаторВход, ЗаголовокРеквизитаВход, ОписаниеТиповВход, МассивДобавленияВход)
	НаименованиеНовогоРеквизита = ПрефиксВход + Строка(ИдентификаторВход);
	НовыйРеквизитФормы = Новый РеквизитФормы(НаименованиеНовогоРеквизита, ОписаниеТиповВход, "", ЗаголовокРеквизитаВход);
	МассивДобавленияВход.Добавить(НовыйРеквизитФормы);
	Возврат НаименованиеНовогоРеквизита;
КонецФункции

// Добавляет на форму в группу ГруппаРодительВход элемент декорацию-картинку ПрефиксВход с
// префиксом и идентификатором ИдентификаторВход.
&НаСервере
Функция ДобавитьДекорациюКартинка(ПрефиксВход, ГруппаРодительВход, ИдентификаторВход, КартинкаВход)
	НаименованиеЭлемента = ПрефиксВход + Строка(ИдентификаторВход);
	НовыйЭлемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ДекорацияФормы"), ГруппаРодительВход);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = КартинкаВход;
	Возврат НовыйЭлемент;
КонецФункции

// Выводит в реквизит формы с имененем НаименованиеРеквизитаВход картинку.
&НаСервере
Процедура ОтобразитьКартинку(НаименованиеРеквизитаВход, ХранилищеЛоготипа, СборникВход)
	Если ТипЗнч(ХранилищеЛоготипа) = Тип("ХранилищеЗначения") Тогда
		НоваяКартинкаПоказателя = ХранилищеЛоготипа.Получить();
		Если ТипЗнч(НоваяКартинкаПоказателя) = Тип("Картинка") Тогда
			АдресКартинки = ПоместитьВоВременноеХранилище(НоваяКартинкаПоказателя, ЭтаФорма.УникальныйИдентификатор);
		Иначе	
			АдресКартинки = "";
		КонецЕсли;
	Иначе 
		Если ЗначениеЗаполнено(СборникВход) Тогда
			НоваяКартинкаПоказателя = СборникВход.КартинкаСборника.Получить();
			АдресКартинки = ПоместитьВоВременноеХранилище(НоваяКартинкаПоказателя, ЭтаФорма.УникальныйИдентификатор);
		Иначе
			АдресКартинки = "";
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма[НаименованиеРеквизитаВход] = АдресКартинки;
КонецПроцедуры

// Формирует текст надписи сборника с наименованием НаименованиеВход
// при достной версии ДоступнаяВерсияВход и установленной версии 
// УстановленнаяВерсияВход.
&НаСервере
Функция ОпределитьТекстНадписиСборника(НаименованиеВход, ДоступнаяВерсияВход, УстановленнаяВерсияВход, РазмерФайлаВход = 0)
	РезультатФункции = "";
	РезультатФункции = НаименованиеВход;
	Если (СокрЛП(ДоступнаяВерсияВход) <> "") И (ДоступнаяВерсияВход <> УстановленнаяВерсияВход) Тогда
		РезультатФункции = РезультатФункции + НСтр("ru = ' (есть обновление!) '");
		Если РазмерФайлаВход <> 0 Тогда
			РезультатФункции = РезультатФункции + " ";
			РазмерКилобайт = РазмерФайлаВход / 1024;
			РезультатФункции = РезультатФункции + Формат(РазмерКилобайт, "ЧДЦ=2; ЧН=0");
			РезультатФункции = РезультатФункции + НСтр("ru = ' КБ'");
		Иначе
			//
		КонецЕсли;
	Иначе
		//РезультатФункции = НаименованиеВход;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ОпределитьТекстНадписиСборника()

// Выводит список сборников на форму.
&НаСервере
Процедура ОтобразитьСборники()
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов);
	Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
		// Инициализация.
		МассивДобавляемых = Новый Массив;
		ТекИдентификатор = ТекТаблицаСборников.ИдентификаторСборника;
		ТекИдентификатор = СтрЗаменить(ТекИдентификатор, "-", "");
		// Группа сборника.
		ИмяГруппыОбщая = "ГруппаСборник_" + Строка(ТекИдентификатор);
		НайденнаяГруппа = Элементы.Найти(ИмяГруппыОбщая);
		ЕстьЭлементы = (НайденнаяГруппа <> Неопределено);
		ГруппаОбщая = ДобавитьГруппуЭлементов("ГруппаСборник_" , Элементы.ГруппаСборники, ТекИдентификатор, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		НаименованиеРеквизитаКартинка = ДобавитьРеквизитФормы("Картинка_", ТекИдентификатор, "", ОписаниеТиповСтрока, МассивДобавляемых);	
		Если Не ЕстьЭлементы Тогда
			ИзменитьРеквизиты(МассивДобавляемых);
			// Картинка.
			ЭлементКартинкаСборника = ДобавитьЭлементФормы("Картинка_", ГруппаОбщая, НаименованиеРеквизитаКартинка, ТекИдентификатор); 	
			// Заголовок сборника.
			ТекстНадписиСборника = ОпределитьТекстНадписиСборника(ТекТаблицаСборников.НаименованиеСборника, ТекТаблицаСборников.ДоступнаяВерсия, ТекТаблицаСборников.УстановленнаяВерсия, ТекТаблицаСборников.РазмерФайла);
			НадписьИмяСборника = ДобавитьДекорациюНадпись("НадписьИмяСборника_", ГруппаОбщая, ТекИдентификатор, ТекстНадписиСборника);
			НадписьИмяСборника.Шрифт = Новый Шрифт(, , Истина);
			// Группа команд.
			ГруппаКоманды = ДобавитьГруппуЭлементов("ГруппаКоманды_" , ГруппаОбщая, ТекИдентификатор, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
			// Команда Подробнее.
			КомандаПодробнее = ДобавитьКомандуФормы("КомандаПодробнее_", ТекИдентификатор);
			ЭлементКомандыПодробнее = ДобавитьЭлементКоманды("КомандаПодробнее_", ГруппаКоманды, ТекИдентификатор); 
			ЭлементКомандыПодробнее.Заголовок = НСтр("ru = 'Подробнее'");
			ЭлементКомандыПодробнее.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
			ЭлементКомандыПодробнее.Вид = ВидКнопкиФормы.Гиперссылка;
			ЭтаФорма.Команды[КомандаПодробнее].Действие = "НажатиеПодробнее_Подключаемый";
			// Команда Скачать.
			КомандаСкачать = ДобавитьКомандуФормы("КомандаСкачать_", ТекИдентификатор);
			ЭлементКомандыСкачать = ДобавитьЭлементКоманды("КомандаСкачать_", ГруппаКоманды, ТекИдентификатор);
			ЭлементКомандыСкачать.Заголовок = "Скачать";
			ЭлементКомандыСкачать.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
			ЭлементКомандыСкачать.Вид = ВидКнопкиФормы.Гиперссылка;
			ЭтаФорма.Команды[КомандаСкачать].Действие = "НажатиеСкачать_Подключаемый";
			// Настройка и отображение картинки.
			ЭлементКартинкаСборника.Вид = ВидПоляФормы.ПолеКартинки;
			ЭлементКартинкаСборника.РастягиватьПоГоризонтали = Ложь;
			ЭлементКартинкаСборника.РастягиватьПоВертикали = Ложь;
			ЭлементКартинкаСборника.Ширина = 20;
			ЭлементКартинкаСборника.РазмерКартинки = РазмерКартинки.АвтоРазмер;
			ЭлементКартинкаСборника.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
			ОтобразитьКартинку(НаименованиеРеквизитаКартинка, ТекТаблицаСборников.КартинкаСборника, ТекТаблицаСборников.СборникСсылка);
		Иначе
			ЭлементКартинкаСборника = ДобавитьЭлементФормы("Картинка_", ГруппаОбщая, НаименованиеРеквизитаКартинка, ТекИдентификатор); 	
			ОтобразитьКартинку(НаименованиеРеквизитаКартинка, ТекТаблицаСборников.КартинкаСборника, ТекТаблицаСборников.СборникСсылка);
			ИдентификаторЗам = СтрЗаменить(Строка(ТекТаблицаСборников.ИдентификаторСборника), "-", "");
			ИмяЭлементаЗаголовок = "НадписьИмяСборника_" + ИдентификаторЗам;
			Если Элементы.Найти(ИмяЭлементаЗаголовок) <> Неопределено Тогда
				ЭлементНадпись = Элементы[ИмяЭлементаЗаголовок];
				ТекстНадписиСборника = ОпределитьТекстНадписиСборника(ТекТаблицаСборников.НаименованиеСборника, ТекТаблицаСборников.ДоступнаяВерсия, ТекТаблицаСборников.УстановленнаяВерсия, ТекТаблицаСборников.РазмерФайла);
				ЭлементНадпись.Заголовок = ТекстНадписиСборника;
			Иначе
				// Элемент не найден. Пропускаем.
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры		// ОтобразитьСборники()

// Обновляет таблицу сборников согласно данным сайта и базы данных.
&НаСервере
Процедура ОбновитьТаблицуСборников_Сервер(ЛегкийФайлВход = Истина)
	ТаблицаСборников.Очистить();
	СчитатьДанныеСборниковССайта(ЛегкийФайлВход);
	СчитатьДанныеСборниковИзБазы();
	ОтобразитьСборники();
	ТаблицаСборников.Сортировать("НаименованиеСборника возр");
КонецПроцедуры		// ОбновитьТаблицуСборников_Сервер()

// Загружает с сайта сборник с именем файла ИмяФайлаВход.
&НаСервере
Функция ЗагрузитьСборникССайта(ИмяФайлаВход)
	РезультатФункции = Истина;
	Попытка
		АдресСтраницы = "";
		АдресСтраницы = АдресСтраницы + "http://livegig.ru/service/exam/";
		АдресСтраницы = АдресСтраницы + ИмяФайлаВход;
		СодержимоеАдреса = ОбменССайтом.ПолучитьСодержимоеВебАдреса(АдресСтраницы);
		РезультатЗагрузки = Обработки.ПереносСборников.ЗагрузитьСборник_Сервер("", СодержимоеАдреса);
		Если РезультатЗагрузки Тогда
			ОбновитьТаблицуСборников_Сервер();
			Если ДостиженияКлиентСервер.ЕстьДостижениеУстановленоПятнадцатьСборников() Тогда
				ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
				ДостижениеУстановленоПятнадцатьСборников = Перечисления.Достижения.УстановленоПятнадцатьСборников;
				ОбщегоНазначенияВызовСервера.ПроверитьИВыдатьДостижениеПользователю(ТекПользователь, ДостижениеУстановленоПятнадцатьСборников);
			Иначе
				// Достижение ещё не получено.
			КонецЕсли;	
		Иначе
			РезультатФункции = Ложь;
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось загрузить файл %ИмяФайла%: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайла%", Строка(ИмяФайлаВход));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		Сообщить(ТекстСообщения);
		РезультатФункции = Ложь;
	КонецПопытки;
	Возврат РезультатФункции;
КонецФункции		// ЗагрузитьСборникССайта()

// Серверная обёртка команды Обновить все.
&НаСервере
Процедура ОбновитьВсе_Сервер()
	ЗагруженоСборников = 0;
	// Непосредственная загрузка.
	Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
		Если ТекТаблицаСборников.ДоступнаяВерсия <> ТекТаблицаСборников.УстановленнаяВерсия Тогда
			Результат = ЗагрузитьСборникССайта(ТекТаблицаСборников.ИмяФайла);
			Если Результат Тогда
				ЗагруженоСборников = ЗагруженоСборников + 1;
			Иначе
				ТекстСообщения = НСтр("ru = 'Не удалось загрузить сборник %Сборник%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Сборник%", Строка(ТекТаблицаСборников.СборникСсылка));
				Сообщить(ТекстСообщения);			
			КонецЕсли; 
		Иначе
			// Нет обновления.
		КонецЕсли;
	КонецЦикла;	
	// Вывод результатов.
	Если ЗагруженоСборников <> 0 Тогда
		ТекстСообщения = НСтр("ru = '%Количество% сборников успешно обновлено'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(ЗагруженоСборников));
		Сообщить(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Обновления для сборников не найдены'");
		Сообщить(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры		// ОбновитьВсе_Сервер()	

// Определяет наличие обновлений в сборниках.
&НаСервере
Функция ОпределитьНаличниеОбновлений()
	РезультатФункции = Ложь;
	Счетчик = 0;
	Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
		Если ТекТаблицаСборников.УстановленнаяВерсия <> ТекТаблицаСборников.ДоступнаяВерсия Тогда
			Счетчик = Счетчик + 1;
		Иначе
			// Выполняем поиск далее.
		КонецЕсли;
	КонецЦикла;	
	РезультатФункции = (Счетчик <> 0);
	Возврат РезультатФункции;	
КонецФункции		// ОпределитьНаличниеОбновлений()

// Управляет видимостью элементов на форме.
&НаСервере
Процедура УправлениеВидимостью()
	// Отображение команды Обновить все.
	ЕстьОбновления = ОпределитьНаличниеОбновлений();
	Элементы.ОбновитьВсе.Доступность = ЕстьОбновления;
КонецПроцедуры		// УправлениеВидимостью()

&НаКлиенте
Функция СчитатьДанныеОСборнике(ИдентификаторВход)
	РезультатФункции = Новый Структура;
		Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
			ТекИдентификатор = ТекТаблицаСборников.ИдентификаторСборника;
			ТекИдентификатор = СтрЗаменить(ТекИдентификатор, "-", "");
			Если СокрЛП(ТекИдентификатор) = СокрЛП(ИдентификаторВход) Тогда
				РезультатФункции.Вставить("НаименованиеСборника",	 ТекТаблицаСборников.НаименованиеСборника);
				РезультатФункции.Вставить("ДоступнаяВерсия",		 ТекТаблицаСборников.ДоступнаяВерсия);
				РезультатФункции.Вставить("УстановленнаяВерсия",	 ТекТаблицаСборников.УстановленнаяВерсия);
				РезультатФункции.Вставить("СборникСсылка",			 ТекТаблицаСборников.СборникСсылка);
			Иначе
				// Выполняем далее.
			КонецЕсли;
		КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		// СчитатьДанныеОСборнике()

&НаКлиенте
Процедура НажатиеПодробнее_Подключаемый(Элемент, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ИмяЭлемента = Элемент.Имя;
	Если СтрДлина(ИмяЭлемента) >= 32 Тогда
		ИдентификаторЭлемента = Прав(ИмяЭлемента, 32);
		СтруктураданныхОСборнике = СчитатьДанныеОСборнике(ИдентификаторЭлемента);
		ОткрытьФорму("Обработка.ОбновлениеСборников.Форма.ФормаПодробнее", СтруктураданныхОСборнике);
	Иначе	
		ТекстСообщения = НСтр("ru = 'Не удалось расшифровать элемент %Элемент%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Элемент%", Строка(Элемент));
		Сообщить(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НажатиеСкачать_Подключаемый(Элемент, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ИмяЭлемента = Элемент.Имя;
	Если СтрДлина(ИмяЭлемента) >= 32 Тогда
		ИдентификаторЭлемента = Прав(ИмяЭлемента, 32);
		Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
			ТекИдентификатор = ТекТаблицаСборников.ИдентификаторСборника;
			ТекИдентификатор = СтрЗаменить(ТекИдентификатор, "-", "");
			Если СокрЛП(ТекИдентификатор) = СокрЛП(ИдентификаторЭлемента) Тогда
				Если СокрЛП(ТекТаблицаСборников.ИмяФайла) <> "" Тогда
					Результат = ЗагрузитьСборникССайта(ТекТаблицаСборников.ИмяФайла);
					ОбновитьТаблицуСборников_Сервер();
				Иначе
					Сообщить(НСтр("ru = 'Файл сборника не найден. Загрузка отменена'"));
					Результат = Ложь;
				КонецЕсли;
				Если Результат Тогда
					Сообщить(НСтр("ru = 'Новый сборник успешно загружен'"));
				Иначе
					Сообщить(НСтр("ru = 'Не удалось загрузить сборник'"));
				КонецЕсли; 
			Иначе
				// Выполняем далее.
			КонецЕсли;
		КонецЦикла;	
	Иначе	
		ТекстСообщения = НСтр("ru = 'Не удалось расшифровать элемент %Элемент%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Элемент%", Строка(Элемент));
		Сообщить(ТекстСообщения);
	КонецЕсли;
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТаблицуСборников_Сервер();
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОбновлениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ОбновитьТаблицуСборников_Сервер(Ложь);
	Иначе       
		// Пользователь отказался.
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСборники(Команда)
	СтруктураПараметров = Новый Структура;
	ТекстВопроса = НСтр("ru = 'Обновление потребует повышенного расхода Интернет-трафика. Продолжить?'");
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПодтверждениеОбновлениеЗавершение", ЭтаФорма, СтруктураПараметров);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсе(Команда)
	ОбновитьВсе_Сервер();
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РазделСправки", "ОбновлениеСборников");
	ОткрытьФорму("Обработка.ОтображениеСправки.Форма.Форма", СтруктураПараметров);
КонецПроцедуры
